## 1.1 2회 기출 유형

https://www.kaggle.com/code/agileteam/tutorial-t1-2-python/notebook

### 문제1
- 데이터셋(basic1.csv)의 'f5' 컬럼을 기준으로 상위 10개의 데이터를 구하고,
- 'f5'컬럼 10개 중 최소값으로 데이터를 대체한 후,
- 'age'컬럼에서 80 이상인 데이터의 'f5' 컬럼 평균값 구하기

In [1]:
import pandas as pd 

df = pd.read_csv('basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [4]:
df = df.sort_values('f5', ascending=False)
df.head(10)

      id   age city    f1  f2   f3    f4         f5
10  id11  40.0   서울  68.0   0  NaN  ENFP  98.429899
9   id10  95.0   서울  74.0   1  NaN  ISFP  98.429899
76  id77  77.0   경기  31.0   0  NaN  INFP  98.429899
97  id98  39.0   경기  58.0   2  NaN  INFP  98.429899
98  id99   1.0   경기  47.0   0  NaN  ESFJ  97.381034
91  id92  97.0   경기  78.0   1  NaN  INFP  97.381034
86  id87  19.0   경기   NaN   1  NaN  ISFP  97.381034
71  id72   8.0   경기  97.0   0  NaN  ESTJ  97.381034
11  id12  20.0   서울   NaN   0  NaN  ESTP  91.297791
19  id20  11.0   서울  51.0   1  NaN  INTJ  91.297791

In [7]:
min = df['f5'][:10].min()
df['f5'][:10] = min
df.head(10)

C:\Users\yusti\AppData\Local\Temp/ipykernel_15636/1273756097.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['f5'][:10] = min

      id   age city    f1  f2   f3    f4         f5
10  id11  40.0   서울  68.0   0  NaN  ENFP  91.297791
9   id10  95.0   서울  74.0   1  NaN  ISFP  91.297791
76  id77  77.0   경기  31.0   0  NaN  INFP  91.297791
97  id98  39.0   경기  58.0   2  NaN  INFP  91.297791
98  id99   1.0   경기  47.0   0  NaN  ESFJ  91.297791
91  id92  97.0   경기  78.0   1  NaN  INFP  91.297791
86  id87  19.0   경기   NaN   1  NaN  ISFP  91.297791
71  id72   8.0   경기  97.0   0  NaN  ESTJ  91.297791
11  id12  20.0   서울   NaN   0  NaN  ESTP  91.297791
19  id20  11.0   서울  51.0   1  NaN  INTJ  91.297791

In [8]:
print(df[df['age']>=80]['f5'].mean())

62.497747125217394

### 문제2
- 데이터셋(basic1.csv)의 앞에서 순서대로 70% 데이터만 활용해서,
- 'f1'컬럼 결측치를 중앙값으로 채우기 전후의 표준편차를 구하고
- 두 표준편차 차이 계산하기

In [9]:
import pandas as pd
df = pd.read_csv('basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [11]:
print(df['id'].count()*0.7)

70.0

In [20]:
df2 = df.loc[0:69, :]
df2['id'].count()

70

In [21]:
std1 = df2['f1'].std()
median = df2['f1'].median()

df2['f1'] = df2['f1'].fillna(median)
std2 = df2['f1'].std()

C:\Users\yusti\AppData\Local\Temp/ipykernel_15636/4095042795.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['f1'] = df2['f1'].fillna(median)

In [23]:
print(std1-std2)

3.2965018033960725

### 문제3
- 데이터셋(basic1.csv)의 'age'컬럼의 이상치를 더하시오!
- 단, 평균으로부터 '표준편차*1.5'를 벗어나는 영역을 이상치라고 판단함

In [24]:
import pandas as pd
df = pd.read_csv('basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [27]:
mean = df['age'].mean()
std = df['age'].std()

age = df[(df['age']>mean+std*1.5) | (df['age']<mean-std*1.5)]

In [31]:
print(age['age'].sum())

473.5

## 1.2 작업형 1유형 예제

https://www.kaggle.com/code/agileteam/mock-exam1-type1-1-tutorial/notebook

### 문제1 

- 첫번째 데이터 부터 순서대로 50:50으로 데이터를 나누고, 
- 앞에서 부터 50%의 데이터(이하, A그룹)는 'f1'컬럼의 결측치를 A그룹의 중앙값으로 채우고, 
- 뒤에서부터 50% 데이터(이하, B그룹)는 'f1'컬럼의 결측치를 B그룹의 최대값으로 채운 후, 
- A그룹과 B그룹의 표준편차 합을 구하시오.
- 단, 소수점 첫째자리까지 구하시오. (둘째자리에서 반올림)
- 데이터셋 : basic1.csv

In [1]:
import pandas as pd
df = pd.read_csv('basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [8]:
a = df.loc[:49]
b = df.loc[50:]
c = df.iloc[:50, :]

In [43]:
a_median = a['f1'].median()
b_max = b['f1'].max()

a['f1'] = a['f1'].fillna(a_median)
b['f1'] = b['f1'].fillna(b_max)

C:\Users\yusti\AppData\Local\Temp/ipykernel_15636/1809801583.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a['f1'] = a['f1'].fillna(a_median)
C:\Users\yusti\AppData\Local\Temp/ipykernel_15636/1809801583.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  b['f1'] = b['f1'].fillna(b_max)

In [46]:
a_std = a['f1'].std()
b_std = b['f1'].std()

print(round(a_std+b_std, 1))

42.0

### 문제2

- 'f4'컬럼을 기준 내림차순 정렬과 'f5'컬럼기준 오름차순 정렬을 순서대로 다중 조건 정렬하고,
- 앞에서부터 10개의 데이터 중 'f5'컬럼의 최소값 찾고, 
- 이 최소값으로 앞에서 부터 10개의 'f5'컬럼 데이터를 변경함.
- 그리고 'f5'컬럼의 평균값을 계산함.
- 단 소수점 둘째자리까지 출력 (셋째자리에서 반올림)

In [47]:
import pandas as pd
df = pd.read_csv('basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [49]:
df = df.sort_values(['f4', 'f5'], ascending=[False, True])
df.head()

      id   age city    f1  f2   f3    f4         f5
42  id43  23.0   대구  60.0   0  NaN  ISTP  29.269869
69  id70  -9.0   경기  96.0   1  NaN  ISTP  48.431184
16  id17  74.0   서울   NaN   1  NaN  ISTP  67.886373
22  id23  34.0   부산  75.0   1  NaN  ISTP  69.730313
2   id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986

In [51]:
min = df['f5'][:10].min()
df['f5'][:10] = min
df.head()

C:\Users\yusti\AppData\Local\Temp/ipykernel_15636/3442547595.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['f5'][:10] = min

      id   age city    f1  f2   f3    f4         f5
42  id43  23.0   대구  60.0   0  NaN  ISTP  17.252986
69  id70  -9.0   경기  96.0   1  NaN  ISTP  17.252986
16  id17  74.0   서울   NaN   1  NaN  ISTP  17.252986
22  id23  34.0   부산  75.0   1  NaN  ISTP  17.252986
2   id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986

In [52]:
print(round(df['f5'].mean(), 2))

53.63

### 문제3

-  'age' 컬럼의 IQR방식을 이용한 이상치 수와 표준편차*1.5방식을 이용한 이상치 수 합을 구하시오
    - IQR방식 : Q1 - 1.5 IQR, Q3 + 1.5 IQR에서 벗어나는 영역을 이상치라고 판단함 (Q1은 데이터의 25%, Q3는 데이터의 75% 지점임)
    - 표준편차1.5방식: 평균으로부터 '표준편차1.5'를 벗어나는 영역을 이상치라고 판단함

In [53]:
import pandas as pd
df = pd.read_csv('basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [55]:
Q1 = df['age'].quantile(0.25)
Q3 = df['age'].quantile(0.75)
IQR = Q3 - Q1
mean = df['age'].mean()
std = df['age'].std()

In [57]:
df_iqr = df[(df['age']>Q3+IQR*1.5)|(df['age']<Q1-IQR*1.5)]
df_std = df[(df['age']>mean+std*1.5)|(df['age']<mean-std*1.5)]

In [58]:
print(df_iqr['id'].count()+df_std['id'].count())

14

## 1.3 공식 예제문제

https://www.kaggle.com/code/agileteam/tutorial-t1-python/notebook

### 작업형: 제 1유형
- mtcars 데이터셋의 qsec 컬럼을 최소최대 척도(Min-Max Scale)로 변환한 후,
- 0.5보다 큰 값을 가지는 레코드 수를 구하시오.

## 1.4 3회 기출 유형

### 문제 1

- 2022년 데이터 중 2022년 중앙값보다 큰 값의 데이터 수를 구하시오
- t1-data2.csv

### 문제 2

- 결측치 데이터(행)을 제거하고, 앞에서부터 60% 데이터만 활용해, 'f1' 컬럼 3사분위 값을 구하시오.
- 60%가 소수점일 경우 절사(예: 36.6 일때 36으로 계산)
- t1-data1.csv

### 문제3

- 결측치가 제일 큰 값의 컬럼명을 구하시오
- t1-data1.csv

## 1.5 T1-1

https://www.kaggle.com/code/agileteam/py-t1-1-iqr-expected-questions/notebook

- 데이터에서 IQR을 활용해 Fare컬럼의 이상치를 찾고, 이상치 데이터의 여성 수를 구하시오
- 데이터 : titanic

In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv('titanic/train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
Q1 = df['Fare'].quantile(0.25)
Q3 = df['Fare'].quantile(0.75)
IQR = Q3-Q1
print(IQR)

23.0896

In [8]:
fare_IQR = df[(df['Fare'] > Q3 + IQR*1.5) | (df['Fare'] < Q1 - IQR*1.5)]

In [15]:
print(fare_IQR['Fare'].count())

116

## 1.6 T1-5

https://www.kaggle.com/code/agileteam/py-t1-5-expected-questions/notebook

- 주어진 데이터 중 basic1.csv에서 'f4'컬럼 값이 'ENFJ'와 'INFP'인 'f1'의 표준편차 차이를 절대값으로 구하시오
- 데이터셋 : basic1.csv

In [46]:
import pandas as pd

df = pd.read_csv('basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [54]:
enfj = df[df['f4']=="ENFJ"]['f1'].std()
infp = df[df['f4']=="INFP"]['f1'].std()

In [58]:
abs(enfj-infp)

5.859621525876811

## 1.7 T1-6

https://www.kaggle.com/code/agileteam/py-t1-6-expected-questions/notebook

- 'f4'컬럼의 값이 'ESFJ'인 데이터를 'ISFJ'로 대체하고, 'city'가 '경기'이면서 'f4'가 'ISFJ'인 데이터 중 'age'컬럼의 최대값을 출력하시오!
- 데이터셋 : basic1.csv

In [22]:
import pandas as pd

df = pd.read_csv('basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [23]:
df['f4'] = df['f4'].replace('ESFJ', 'ISFJ')
df['f4'].value_counts()

ISFJ    15
ESTP    11
ISFP    10
ESTJ     9
INTP     8
ENFJ     6
INFP     6
ENFP     6
ENTP     6
ENTJ     5
INFJ     4
ESFP     4
ISTP     4
INTJ     4
ISTJ     2
Name: f4, dtype: int64

In [25]:
df2 = df[(df['city']=='경기')&(df['f4']=='ISFJ')]
df2

      id   age city    f1  f2   f3    f4         f5
62  id63  88.0   경기  86.0   1  NaN  ISFJ  73.586397
66  id67  66.0   경기  52.0   1  NaN  ISFJ  73.586397
72  id73  90.0   경기   NaN   1  NaN  ISFJ  73.586397
80  id81  86.0   경기  50.0   1  NaN  ISFJ  37.113739
98  id99   1.0   경기  47.0   0  NaN  ISFJ  97.381034

In [26]:
print(df2['age'].mean())

66.2

## 1.8 T1-9

https://www.kaggle.com/code/agileteam/py-t1-9-expected-questions/notebook

- 주어진 데이터에서 'f5'컬럼을 표준화(Standardization (Z-score Normalization))하고 그 중앙값을 구하시오
- 데이터셋 : basic1.csv

In [27]:
import pandas as pd

df = pd.read_csv('basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [28]:
f5_mean = df['f5'].mean()
f5_std = df['f5'].std()
print(f5_mean, f5_std)

56.73453674492999 28.454243730610507

In [30]:
f5_z = (df['f5']-f5_mean)/f5_std
f5_z

0     1.214696
1     0.126705
2    -1.387545
3    -0.142947
4    -0.965222
        ...
95   -0.142947
96    0.391922
97    1.465348
98    1.428486
99   -0.823270
Name: f5, Length: 100, dtype: float64

In [31]:
f5_z.median()

0.2593132572746011